<?php

/*** Task №1 ***/

$i = 0;
while ($i <= 100) {
    if (!($i % 3)) {
        echo "$i<br>";
    }
    $i++;
}

echo "<br><br>";

/*** Task №2 ***/

$i = 0;
do {
    if (!$i) {
        $text = "ноль.";
    } elseif (!($i % 2)) {
        $text = "четное число.";
    } else {
        $text = "нечетное число.";
    }
    echo "$i - $text<br>";
    $i++;
} while ($i <= 10);

echo "<br><br>";

/*** Task №3 ***/

$arDirectory = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Пермский край" => ["Пермь", "Березники", "Соликамск", "Краснокамск"],
];

foreach ($arDirectory as $region => $arCity) {
    echo "$region:<br>";
    echo implode(", ", $arCity);
    echo "<br>";
}

echo "<br><br>";

/*** Task №4 ***/

$arTranslit = [
    "а" => "a",
    "б" => "b",
    "в" => "v",
    "г" => "g",
    "д" => "d",
    "е" => "e",
    "ё" => "yo",
    "ж" => "zh",
    "з" => "z",
    "и" => "i",
    "й" => "j",
    "к" => "k",
    "л" => "l",
    "м" => "m",
    "н" => "n",
    "о" => "o",
    "п" => "p",
    "р" => "r",
    "с" => "s",
    "т" => "t",
    "у" => "u",
    "ф" => "f",
    "х" => "h",
    "ц" => "c",
    "ч" => "ch",
    "ш" => "sh",
    "щ" => "shh",
    "ъ" => "",
    "ы" => "y",
    "ь" => "",
    "э" => "je",
    "ю" => "yu",
    "я" => "ya",
    "А" => "A",
    "Б" => "B",
    "В" => "V",
    "Г" => "G",
    "Д" => "D",
    "Е" => "E",
    "Ё" => "Yo",
    "Ж" => "Zh",
    "З" => "Z",
    "И" => "I",
    "Й" => "J",
    "К" => "K",
    "Л" => "L",
    "М" => "M",
    "Н" => "N",
    "О" => "O",
    "П" => "P",
    "Р" => "R",
    "С" => "S",
    "Т" => "T",
    "У" => "U",
    "Ф" => "F",
    "Х" => "H",
    "Ц" => "C",
    "Ч" => "Ch",
    "Ш" => "Sh",
    "Щ" => "Shh",
    "Ъ" => "",
    "Ы" => "Y",
    "Ь" => "",
    "Э" => "Je",
    "Ю" => "Yu",
    "Я" => "Ya",
];

$text = 'strtr — Преобразует заданные символы или заменяет подстроки. Если указаны три аргумента, эта функция возвращает копию str, в которой все вхождения каждого символа (однобайтного) из from были заменены на соответствующий символ в параметре to, т.е. каждое вхождение из $from[$n] заменяется на $to[$n], где $n это корректное смещение строки в обоих аргументах.';

echo strtr($text, $arTranslit);

echo "<br><br>";

/*** Task №5 ***/

echo strtr($text, " ", "_");

echo "<br><br>";

/*** Task №7 ***/

for ($i = 0; $i < 10; print($i."<br>"), $i++) {}

echo "<br><br>";

/*** Task №8 ***/

$arDirectory = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Пермский край" => ["Пермь", "Березники", "Соликамск", "Краснокамск"],
];

foreach ($arDirectory as $region => $arCity) {
    echo "$region:<br>";
    foreach ($arCity as $city) {
        if (substr($city, 0, 1) == "К") {
            echo "$city<br>";
        }
    }
}

echo "<br><br>";

/*** Task №9 ***/

function toTranslit($str) {
    $arTranslit = [
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "j",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "c",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "shh",
        "ъ" => "",
        "ы" => "y",
        "ь" => "",
        "э" => "je",
        "ю" => "yu",
        "я" => "ya",
        "А" => "A",
        "Б" => "B",
        "В" => "V",
        "Г" => "G",
        "Д" => "D",
        "Е" => "E",
        "Ё" => "Yo",
        "Ж" => "Zh",
        "З" => "Z",
        "И" => "I",
        "Й" => "J",
        "К" => "K",
        "Л" => "L",
        "М" => "M",
        "Н" => "N",
        "О" => "O",
        "П" => "P",
        "Р" => "R",
        "С" => "S",
        "Т" => "T",
        "У" => "U",
        "Ф" => "F",
        "Х" => "H",
        "Ц" => "C",
        "Ч" => "Ch",
        "Ш" => "Sh",
        "Щ" => "Shh",
        "Ъ" => "",
        "Ы" => "Y",
        "Ь" => "",
        "Э" => "Je",
        "Ю" => "Yu",
        "Я" => "Ya",
    ];

    return strtr($str, $arTranslit);
}

function replaceWhitespace($str) {
    return strtr($str, " ", "_");
}

function changeString($str) {
    echo replaceWhitespace(toTranslit($str));
}

changeString($text);